{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "QuantizedConv2D", "config": {"name": "conv_0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "conv_0", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "conv_0_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "conv_0_relu", "inbound_nodes": [[["conv_0", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_1", "inbound_nodes": [[["conv_0_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_1_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_1_relu", "inbound_nodes": [[["separable_1", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_2", "inbound_nodes": [[["separable_1_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_2_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_2_relu", "inbound_nodes": [[["separable_2", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_3", "inbound_nodes": [[["separable_2_relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "separable_3_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "separable_3_maxpool", "inbound_nodes": [[["separable_3", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_3_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_3_relu", "inbound_nodes": [[["separable_3_maxpool", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_4", "inbound_nodes": [[["separable_3_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_4_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_4_relu", "inbound_nodes": [[["separable_4", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_5", "inbound_nodes": [[["separable_4_relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "separable_5_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "separable_5_maxpool", "inbound_nodes": [[["separable_5", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_5_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_5_relu", "inbound_nodes": [[["separable_5_maxpool", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_6", "inbound_nodes": [[["separable_5_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_6_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_6_relu", "inbound_nodes": [[["separable_6", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_7", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_7", "inbound_nodes": [[["separable_6_relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "separable_7_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "separable_7_maxpool", "inbound_nodes": [[["separable_7", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_7_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_7_relu", "inbound_nodes": [[["separable_7_maxpool", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_8", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_8", "inbound_nodes": [[["separable_7_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_8_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_8_relu", "inbound_nodes": [[["separable_8", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_9", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_9", "inbound_nodes": [[["separable_8_relu", 0, 0, {}]]]}, {"class_name": "ActivationDiscreteRelu", "config": {"name": "separable_9_relu", "trainable": true, "dtype": "float32", "bitwidth": 8}, "name": "separable_9_relu", "inbound_nodes": [[["separable_9", 0, 0, {}]]]}, {"class_name": "QuantizedSeparableConv2D", "config": {"name": "separable_10", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "quantizer_dw": {"class_name": "MaxQuantizer", "config": {"bitwidth": 8}}, "quantizer": {"class_name": "MaxPerAxisQuantizer", "config": {"bitwidth": 8}}}, "name": "separable_10", "inbound_nodes": [[["separable_9_relu", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "separable_10_global_avg", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "separable_10_global_avg", "inbound_nodes": [[["separable_10", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["separable_10_global_avg", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}